# Cli application based on ENM (Ericsson Network Manager) REST API

[![Github version](https://img.shields.io/github/package-json/version/vvsviridov/enm-cli?label=enm-cli&color=brightgreen&logo=github)](https://github.com/vvsviridov/enm-cli)
[![Npm version](https://img.shields.io/npm/v/enm-cli?color=red&logo=npm&label=enm-cli)](https://www.npmjs.com/package/enm-cli)

## Main goal

A simple command line interface for some of the Ericsson Network Manager applications.

## Installation

First you need **node.js** which can be downloaded from official site [nodejs.org](https://nodejs.org/en/download/) and installed as described in the docs.

Then you can run directly from NPM without installation

```
npx enm-cli -u https://enm.your.company.domain.com
```

Or install with NPM

```
npm i enm-cli
```

Or download this repository and run from the project root directory ...

```
npm install
```

... to install dependencies,

```
npm link
```

... to add application to your OS $PATH variable if you want to run it from anywhere.
Now you can launch apllication

```
> enm-cli -l USERNAME -p PASSWORD -u https://enm.your.company.domain.com
ðŸ’¾ Select Application: (Use arrow keys)
> Topology Browser
  Auto Provisioning
  Bulk Import
```

## Store your credentials to file

Create `.env` file in project's root folder and store your credentials as:

```
LOGIN=YourLogin
PASSWORD=YourPassword
```

## Usage

Recommended environment is Windows Terminal (not _cmd.exe_) or any shell with rich formatting support. After application successfully launched youll see root content and available commands.

### Help Page

```
> enm-cli --help
Usage: enm-cli [options]

Options:
  -V, --version                output the version number
  -l, --login <letters>        ENM User Login (env: LOGIN)
  -p, --password <letters>     ENM User Password (env: PASSWORD)
  -a, --application <letters>  Start specified application (choices: "tplg", "prvn", "bulk")
  -u, --url <valid URL>        ENM Url
  -h, --help                   display help for command
```

# AutoProvisioning Application

### Connection

```
>enm-cli -l USERNAME -p PASSWORD -u https://enm.your.company.domain.com -a prvn
âœ” Login in...
âœ” Getting projects...
323 projects> (Use arrow keys or type to search)
  â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
> [new]
  [exit]
  â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
  Project1      (1) 1âœ…
  Project2      (2) 1âœ… 1âŒ›
  Project3      (2) 1âŒ 1âŒš
  Project4      (1) 1âŒ
```

### Working with Projects

- `[new]` - Import an Auto Provisioning project to start Auto Provisioning workflows based on the content of the AutoProvisioning project. The Auto Provisioning project file contains project related data in the projectInfo.xml file and node folders which contain configurations required to execute AutoProvisioning use-cases.
- `[exit]` - Exit this app.

Start typing and you see only commands and projects matches input.

```
323 projects> pro
â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
> Project1      (1) 1âœ…
  Project2      (2) 1âœ… 1âŒ›
  Project3      (2) 1âŒ 1âŒš
  Project4      (1) 1âŒ
SubNetwork=ONRM_ROOT_MO> ex
â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
>[exit]
â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
```

### Working with Single Project

Select project you want to work with.

Available commands are:

- `[delete]` - Delete of an Auto Provisioning project removes an Auto Provisioning project and all the Auto Provisioning data for nodes within that project. This includes removal or rollback of any ongoing Auto Provisioning workflows within that project.
- `[back]` - Return to projects.
- `[exit]` - Exit this app.

```
323 projects> Project1      (1) 1âœ…
âœ” Getting Project1s status...
âœ” Getting Project1s properties...

    Project id    : Project1
    Author        : Ericsson
    Creation Date : 2019-01-06 11:23:39
    Description   : Project1 description
    Nodes         :

      RadioNode1
      RadioNode
      3432-762-238
      192.168.192.168
      Successful
      Integration Completed

Project1> (Use arrow keys or type to search)
  â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
> [delete]
  [back]
  [exit]
  â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
  RadioNode1
```

### Wotking with Node

Select node ...

```
Project1 (RadioNode1) > (Use arrow keys or type to search)
  â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
> [status]
  [properties]
  [delete]
  [bind]
  [cancel]
  [resume]
  [configurations]
  [siteinstall]
  [back]
(Move up and down to reveal more choices)
```

Available commands are:

- `[status]` - Retrieving Auto Provisioning node status returns the node status information for each task that has been executed for the specified node.
- `[properties]` - Retrieving Auto Provisioning node properties returns the node properties for each task that has been executed for the specified node.
- `[delete]` - Delete an Auto Provisioning node removes the Auto Provisioning data for a Network Element. If a node is the last node in a project and there are no profiles associated with the project the project will automatically be deleted.
- `[bind]` - Binding a hardware serial number to a node configuration associates the specified node configurations with a hardware serial number for Zero Touch Integration or Hardware Replace.
- `[cancel]` - Cancelling the auto provisioning activity rolls back an AutoProvisoning workflow for Node Integration. For expansion a node is rolled back to it\s original configuration if additional configurations have been applied to the node.
- `[resume]` - Resuming the auto provisioning activity recommences an Auto Provisioning workflow that is suspended.
- `[configurations]` - Uploading an auto provisioning configuration replaces a configuration file that was part of the initial Auto Provisioning node configuration.
- `[siteinstall]` - Download Site Installation File (SIF) that is required to be taken on site for LMT Integration or LMT Hardware Replace.
- `[back]` - Return to project's nodes.
- `[exit]` - Exit this app.

# TopologyBrowser Application

```
PS C:\> enm-cli -l USERNAME -p PASSWORD -u https://enm.your.company.domian.com -a tplg
âœ” Login in...
Authentication Successful
âœ” Starting Topology Browser...
âœ” Reading Topology...
 SubNetwork=ONRM_ROOT_MO> (Use arrow keys or type to search)
> SubNetwork=Core
  SubNetwork=LTE
  SubNetwork=RBS
  SubNetwork=RNC
  show
  config
  up
  home
  exit
```

### Commands

> **Note:** _only `show` and `fdn` command can have parameter, all other commands haven't._

- `[show] [<valid regex>]` - shows current object's attributes filtered with regex
- `[config]` - enters _config_ mode
- `[up]` - navigate up one level
- `[fdn] [<valid FDN>]` - navigate to FDN
- `[home]` - navigate to root folder
- `[alarms]` - show alarms
- `[search]` - searching specified node in topology
- `[sync]` - initiate node CM synchronization
- `[persistent]` - toggle persistent attributes inclusion
- `[amos]` - launch advanced moshell (amos)
- `[scripting]` - launch shell terminal on scripting VM
- `[wfcli]` - launch WinFIOL CLI
- `[exit]` - logout and exit application

### Advanced MOshell Scripting, Scripting Terminal and WinFIOL CLI

These applications are executes on ENM virtual machines and does not required any local installation

### Examples

Start typing and you see only matches commands to your input.

```
SubNetwork=ONRM_ROOT_MO> subn
> SubNetwork=Core
  SubNetwork=LTE
  SubNetwork=RBS
  SubNetwork=RNC
SubNetwork=ONRM_ROOT_MO> exi
>exit
```

You can navigate to the next level selecting object ...

```
SubNetwork=ONRM_ROOT_MO> subn
  SubNetwork=Core
  SubNetwork=LTE
  SubNetwork=RBS
> SubNetwork=RNC
SubNetwork=ONRM_ROOT_MO,SubNetwork=RNC>
> MeContext=RNC01
  MeContext=RNCTEST
  MeContext=TEST
```

View objects attributes ...

```
SubNetwork=ONRM_ROOT_MO,SubNetwork=RNC> show
> show
âœ” Reading Topology...

  FDN: SubNetwork=ONRM_ROOT_MO,SubNetwork=RNC

  SubNetworkId: RNC

SubNetwork=ONRM_ROOT_MO,SubNetwork=RNC> MeContext=RNC01
> MeContext=RNC01
âœ” Reading Topology...
... Network=ONRM_ROOT_MO,SubNetwork=RNC,MeContext=RNC01> show
> show
âœ” Reading Topology...

  FDN: SubNetwork=ONRM_ROOT_MO,SubNetwork=RNC,MeContext=RNC01

  MeContextId: RNC01
  neType: RNC
  platformType: CPP
```

... show attributes with filter

```
... Network=ONRM_ROOT_MO,SubNetwork=RNC,MeContext=RNC01> show Type
> show type
âœ” Reading Topology...

  FDN: SubNetwork=ONRM_ROOT_MO,SubNetwork=RNC,MeContext=RNC01

  neType: RNC
  platformType: CPP

... Network=ONRM_ROOT_MO,SubNetwork=RNC,MeContext=RNC01>
```

Return one level up in FDN tree ...

```
... Network=ONRM_ROOT_MO,SubNetwork=RNC,MeContext=RNC01> up
> up
âœ” Reading Topology...
SubNetwork=ONRM_ROOT_MO,SubNetwork=RNC>
```

Return to the root from anywhere ...

```
... Network=ONRM_ROOT_MO,SubNetwork=RNC,MeContext=RNC01> home
> home
âœ” Reading Topology...
SubNetwork=ONRM_ROOT_MO>
```

Go to specific FDN ...

```
... Network=ONRM_ROOT_MO,SubNetwork=RNC,MeContext=RNC01> fdn NetworkElement=RBS01
```

And logout and exit ...

```
... Network=ONRM_ROOT_MO,SubNetwork=RNC,MeContext=RNC01> exit
> exit
âœ” Logout...
Logout OK
PS C:\>
```

### Config Mode

To modify attributes _config_ mode is used.

Available commands are:

- `[commit]` - commiting changes to the network
- `[check]` - view configuration changes
- `[get]` - get attribute value
- `[set]` - set attribute value
- `[end]` - end config mode without commiting
- `[exit]` - logout and exit application

```
... ManagedElement=ERBS01,ENodeBFunction=1,EUtranCellFDD=test1> config
> config
âœ” Reading Attributes...
âœ” Reading Attributes Data...

    syncStatus: SYNCHRONIZED
    ipAddress: 10.10.11.1
    managementState: NORMAL
    radioAccessTechnology: 4G, 3G

... lement=ERBS01,ENodeBFunction=1,EUtranCellFDD=test1(config)# (Use arrow keys or type to search)
> acBarringForCsfb
  acBarringForEmergency
  acBarringForMoData
  acBarringForMoSignalling
  ...
  commit
  check
  end
  exit
(Move up and down to reveal more choices)
```

To modify attribute select it ...

```
... lement=ERBS01,ENodeBFunction=1,EUtranCellFDD=test1(config)# userLabel
... ent=ERBS01,ENodeBFunction=1,EUtranCellFDD=test1(userLabel)#
  commit
  check
  end
  exit
> get
  set
  description
```

Now you can get it ...

```
... ent=ERBS01,ENodeBFunction=1,EUtranCellFDD=test1(userLabel)# get
> get

  FDN: SubNetwork=ONRM_ROOT_MO,SubNetwork=RBS,MeContext=ERBS01,ManagedElement=1,ENodeBFunction=1,EUtranCellFDD=test1(userLabel)

  userLabel: test1

  Type: STRING

```

And set it's value ...

```
... ent=ERBS01,ENodeBFunction=1,EUtranCellFDD=test1(userLabel)# set
? userLabel (STRING): ? test_label
```

Check configuration before applying

```
... ent=ERBS01,ENodeBFunction=1,EUtranCellFDD=test1(userLabel)# check

  FDN: SubNetwork=ONRM_ROOT_MO,SubNetwork=RBS,MeContext=ERBS01,ManagedElement=ERBS01,ENodeBFunction=1,EUtranCellFDD=test1

  userLabel: test_label

```

Applying changes to the network ...

```
... ent=ERBS01,ENodeBFunction=1,EUtranCellFDD=test1(userLabel)# commit

  FDN: SubNetwork=ONRM_ROOT_MO,SubNetwork=RBS,MeContext=ERBS01,ManagedElement=ERBS01,ENodeBFunction=1,EUtranCellFDD=test1

  userLabel: test_label
âœ” Commiting Config...
Success
```

View attribute's description

```
... lement=ERBS01,ENodeBFunction=1,EUtranCellFDD=test1(config)# acBarringForCsfb
... S01,ENodeBFunction=1,EUtranCellFDD=test1(acBarringForCsfb)# description

acBarringForCsfb: COMPLEX_REF

DESCRIPTION
      Access class barring parameters for mobile originating CSFB calls.
The information is broadcasted in SIB2.

TRAFFIC DISTURBANCES
      Changing this attribute can cause loss of traffic.

IMMUTABLE
      false

ACTIVE CHOICE CASE
      null


COMPLEX_REF
    AcBarringConfig: AcBarringConfig


acBarringTime: INTEGER  default: 64

DESCRIPTION
      Mean access barring time in seconds for mobile originating signalling.

IMMUTABLE
      false

ACTIVE CHOICE CASE
      null

CONSTRAINTS
    Nullable: false
    Value Resolution: null


acBarringForSpecialAC: LIST  default: false,false,false,false,false

DESCRIPTION
      Access class barring for AC 11-15. The first instance in the list is for AC 11, second is for AC 12, and so on.

IMMUTABLE
      false

ACTIVE CHOICE CASE
      null

CONSTRAINTS
    Nullable: false
LISTREFERENCE
    BOOLEAN
CONSTRAINTS
    Nullable: true


acBarringFactor: INTEGER  default: 95

DESCRIPTION
      If the random number drawn by the UE is lower than this value, access is allowed. Otherwise the access is barred.

IMMUTABLE
      false

ACTIVE CHOICE CASE
      null

CONSTRAINTS
    Nullable: false
    Value Resolution: null
```

## Contribution

1. [Fork it]
2. Create your feature branch (`git checkout -b my-new-feature`)
3. Commit your changes (`git commit -am Add some feature`)
4. Push to the branch (`git push origin my-new-feature`)
5. Create new Pull Request

## Known Issues

### flickering issue

In some windows terminal spinner may look flickery. To fix this you need to modify file ./node_modules/ora/index.js

Add 1 to _clearLine()_ on this line

```javascript
this.stream.clearLine(1);
```

## Credits

[Contact Me](https://github.com/vvsviridov/) to request new feature or bugs reporting.

## Changes

1.0.0 - Is released

1.0.2 - Bulk Import added

1.0.5 - Fix AutoProvisioning errors

1.0.6 - Ability to launch amos, scripting shell terminal and winfiol cli
